public/programming/free-as-in-freedom.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="../subjects.html">Subjects</a> &gt; <a href="programming.html">Programming</a> &gt;
</p>
<div id="outline-container-org76be035" class="outline-2">
<h2 id="org76be035">Free as in Freedom</h2>
<div class="outline-text-2" id="text-org76be035">
<p>
As a programmer, I believe in the principles of free software:
</p>

<ul class="org-ul">
<li>The freedom to run the program as you wish, for any purpose</li>
<li>The freedom to study how the program works, and change it so it does
your computing as you wish. Access to the source code is a
precondition for this.</li>
<li>The freedom to redistribute copies so you can help others.</li>
<li>The freedom to distribute copies of your modified versions to
others. By doing this you can give the whole community a chance to
benefit from your changes. Access to the source code is a
precondition for this.</li>
</ul>

<p>
I always tend towards free and open source software for my personal
use, reducing the amount of propretary technologies to its minimum.
</p>

<p>
Living in a free software world is completely doable. Linux (or BSDs)
are great and powerful operating systems. You have the freedom to
manage your own system the way you want: use a FOSS file editor (vim,
emacs, nano), window manager (i3, dwm&#x2026;), editing software (gimp,
krita, kdenlive), you can self host open source services on your
machine to manage photos or websites. And many more.
</p>

<p>
We are full of great FOSS software and it is improving every day
thanks to the great effort of the community.
</p>

<hr />

<p>
Travel: <a href="programming.html">Programming</a>, <a href="../theindex.html">Index</a> 
</p>
</div>
</div>
</div>
</body>
</html>
